In [184]:
from pandas import Series, DataFrame
import pandas as pd
import os
import numpy as np
import datetime as dt
import calendar

In [76]:
print(os.getcwd())

/Users/zifuche/Desktop/Python Assignment3

In [185]:
df = pd.read_csv(os.getcwd()+'/vehicle_collisions.csv')
df1=df[df["DATE"].str.endswith("16")]

In [186]:
df1.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
217539,3374565,1/1/16,0:01,MANHATTAN,10022.0,40.760223,-73.967462,"(40.7602226, -73.967462)",EAST 57 STREET,3 AVENUE,...,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN,NaN,OTHER VEHICULAR,OTHER VEHICULAR,NaN,NaN,NaN
217540,3511927,1/1/16,0:01,BROOKLYN,11235.0,NaN,NaN,NaN,EMMONS AVENUE,OCEAN AVENUE,...,PASSENGER VEHICLE,BICYCLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN
217541,3363408,1/1/16,0:01,MANHATTAN,10035.0,40.805057,-73.939034,"(40.8050573, -73.9390342)",EAST 125 STREET,PARK AVENUE,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,UNSPECIFIED,NaN,NaN,NaN,NaN
217542,3364610,1/1/16,0:05,MANHATTAN,10035.0,40.799258,-73.939050,"(40.7992577, -73.9390504)",3 AVENUE,EAST 118 STREET,...,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN
217543,3363371,1/1/16,0:15,MANHATTAN,10011.0,40.738552,-73.999682,"(40.738552, -73.9996824)",7 AVENUE,WEST 14 STREET,...,SPORT UTILITY/STATION WAGON,OTHER,NaN,NaN,NaN,LOST CONSCIOUSNESS,UNSPECIFIED,NaN,NaN,NaN

In [187]:
df2=df1[["DATE","BOROUGH"]]

# data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
# 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# frame = DataFrame(data)
# frame


# data={"MONTH":["JAN","FEB","MAR","APR","MAY","JUN","JUL","AUG","SEP","OCT","NOV","DEC"],"MANHATTAN"}
def getMonth(s):
    return s.split("/")[0]
def getDay(s):
    return s.split("/")[1]

In [192]:
df2.head()

          DATE    BOROUGH
217539  1/1/16  MANHATTAN
217540  1/1/16   BROOKLYN
217541  1/1/16  MANHATTAN
217542  1/1/16  MANHATTAN
217543  1/1/16  MANHATTAN

In [190]:
z=df2.copy()

In [193]:
z["DATE"]=pd.to_datetime(z["DATE"],infer_datetime_format=True)

In [194]:
z["DATE"]=z["DATE"].dt.month

In [195]:
z["DATE"]=z["DATE"].apply(lambda x: calendar.month_abbr[x])

In [196]:
z.head()

       DATE    BOROUGH
217539  Jan  MANHATTAN
217540  Jan   BROOKLYN
217541  Jan  MANHATTAN
217542  Jan  MANHATTAN
217543  Jan  MANHATTAN

In [197]:
len(z)

227605

In [198]:
q=z[z["BOROUGH"]=="MANHATTAN"]

In [205]:
dtt1=q.groupby(["DATE"]).count()

In [199]:
z['BOROUGH'] = z['BOROUGH'].apply(lambda x: x if not np.nan else -1)

In [206]:
dtt2=z.groupby(["DATE"]).count()

In [217]:

dtt1.columns=["MANHATTAN"]
dtt1

      MANHATTAN
DATE
Apr        3540
Aug        2844
Dec        2634
Feb        3195
Jan        3178
Jul        3055
Jun        2956
Mar        3479
May        3432
Nov        2838
Oct        2831
Sep        2744

In [218]:
dtt2.columns=["NYC"]
dtt2

        NYC
DATE
Apr   18331
Aug   19678
Dec   19214
Feb   15985
Jan   18101
Jul   19867
Jun   19433
Mar   18471
May   20052
Nov   19315
Oct   19666
Sep   19492

In [232]:
r=pd.merge(dtt1, dtt2, right_index=True, left_index=True)
r["PERCENTAGE"]=r["MANHATTAN"]/r["NYC"]
r

      MANHATTAN    NYC  PERCENTAGE
DATE
Apr        3540  18331    0.193115
Aug        2844  19678    0.144527
Dec        2634  19214    0.137088
Feb        3195  15985    0.199875
Jan        3178  18101    0.175570
Jul        3055  19867    0.153773
Jun        2956  19433    0.152112
Mar        3479  18471    0.188349
May        3432  20052    0.171155
Nov        2838  19315    0.146932
Oct        2831  19666    0.143954
Sep        2744  19492    0.140776

In [241]:
newindex=["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"]
re=r.reindex(newindex)

In [242]:
re

      MANHATTAN    NYC  PERCENTAGE
DATE
Jan        3178  18101    0.175570
Feb        3195  15985    0.199875
Mar        3479  18471    0.188349
Apr        3540  18331    0.193115
May        3432  20052    0.171155
Jun        2956  19433    0.152112
Jul        3055  19867    0.153773
Aug        2844  19678    0.144527
Sep        2744  19492    0.140776
Oct        2831  19666    0.143954
Nov        2838  19315    0.146932
Dec        2634  19214    0.137088

In [243]:

re.to_csv('Q1-1.csv')

In [226]:
# df3=df2[df2["DATE"].str.startswith("1/")]
# df3.head()

In [227]:
# df3[df3["BOROUGH"]=="MANHATTAN"].head()

In [228]:
# len(df3.index)

In [ ]:
# data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
# 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# frame = DataFrame(data)
# frame
# DataFrame(data, columns=['year', 'state', 'pop'])

In [24]:
# def caculater(month):
#     df3=df2[df2["DATE"].str.startswith(month+"/")]
#     df4=df3[df3["BOROUGH"]=="MANHATTAN"]
#     data={"MONTH":[month],"MANHATTAN":[len(df4.index)],"NYC":[len(df3.index)],"PERCENTAGE":[len(df4.index)/len(df3.index)]}
#     frame=DataFrame(data,columns=["MONTH","MANHATTAN","NYC","PERCENTAGE"])
#     return frame

In [235]:
# caculater("1")

In [69]:
# monthlist=["2","3","4","5","6","7","8","9","10","11","12"]

# frame1=[caculater("1"),caculater("2")]
# result=pd.concat(frame1)

In [70]:
# def getre(monthlist):
#     result=caculater("1")
#     for month in monthlist:       
#         frame=[result,caculater(month)]
#         result=pd.concat(frame)
#     return result

In [63]:
# df5=getre(monthlist)

In [72]:
# df5["MONTH"].replace(["1","2","3","4","5","6","7","8","9","10","11","12"],["JAN","FEB","MAR","APR","MAY","JUN","JUL","AUG","SEP","OCT","NOV","DEC"],inplace=True)

In [234]:
# df5